STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_SerialPort_CentralPeripheral/STM32_BLE/App/app_ble.c
      status = aci_gap_start_procedure (GAP_GENERAL_DISCOVERY_PROC,LE_1M_PHY_BIT,0,0);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_start_procedure - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> aci_gap_start_procedure - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_START */
    case PROC_GAP_CENTRAL_SCAN_TERMINATE:
    {
      status = aci_gap_terminate_proc(GAP_GENERAL_DISCOVERY_PROC);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_terminate_gap_proc - fail, result: 0x%02X\n",status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_TERMINATE */
    /* USER CODE BEGIN GAP_CENTRAL_2 */
    /**
     * This case handles the process of creating a connection to a Serial Port Server
     * when a GAP Central Connect Request is received. It first checks if a device
     * server has been found. If a device server is found, it attempts to set the
     * connection configuration and then create a connection to the server.
     *
     * If the connection configuration is successful, it proceeds to create the connection
     * using the server's address type and address. It then waits for the connection complete
     * event.
     */
    case PROC_GAP_CENTRAL_CONNECT_REQUEST:
    {
     
      tBleStatus result;
      
      if (bleAppContext.deviceServerFound != 0)
      {
        /* Reset deviceServerFound for future connections. */
        bleAppContext.deviceServerFound = 0;
        
        APP_DBG_MSG("Create connection to Serial Port Server\n");
        
        result = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                      CONN_INT_MS(20u), 
                                                      CONN_INT_MS(100u),
                                                      0u,
                                                      CONN_SUP_TIMEOUT_MS(1000u),
                                                      CONN_CE_LENGTH_MS(20u), 
                                                      CONN_CE_LENGTH_MS(20u));
        
        if (result == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02x\n", result);
        }
        else
        {
          APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02x\n", result);
        }  
        result = aci_gap_create_connection(LE_1M_PHY_BIT,
                                           bleAppContext.deviceServerBdAddrType,
                                           &bleAppContext.a_deviceServerBdAddr[0]);    
        if (result == BLE_STATUS_SUCCESS)
        {
          bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
          APP_DBG_MSG("  wait for event HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE\n");
          UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_CONNECTION_COMPLETE);

        }
        else
        {
          APP_DBG_MSG("==>> GAP Create connection Failed , result: 0x%02x\n", result);
        }
      }
      break;
    }
    /* USER CODE END GAP_CENTRAL_2 */
    default:
      break;
  }
  return;
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */


/**
 * @brief Initiates a connection request as a central device in a BLE network.
 *
 * This function triggers the GAP (Generic Access Profile) procedure to send a 
 * connection request from the central device to a peripheral device. It uses 
 * the APP_BLE_Procedure_Gap_Central function with the PROC_GAP_CENTRAL_CONNECT_REQUEST 
 * parameter to perform this action.
 *
 * @note This function does not take any parameters and does not return any value.
 */
static void Connect_Request(void)
{
  APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_CONNECT_REQUEST);  
  return;
}

/**
* @brief Request to cancel advertising.
*
* This function sets a task to cancel advertising.
*
* @param arg Pointer to the argument (not used in this function).
*
*/
static void Adv_Cancel_Req(void *arg)
{
  APP_DBG_MSG("Adv_Cancel_Req\n");
  
  /* LED2 is off when the advertising stops due to the timer callback. */
  BSP_LED_Off(LD2);

  UTIL_SEQ_SetTask(1U << CFG_TASK_ADV_CANCEL_ID, CFG_SEQ_PRIO_0);
  return;
}


/**
* @brief Cancel the advertising process.
*
* This function stops the advertising process and updates the device connection
* status to idle. It also turns off the green LED to indicate that advertising
* has been stopped.
*
* @note This function is specific to CFG_TASK_ADV_CANCEL_ID.
*/
static void Adv_Cancel(void)
{
  HAL_RADIO_TIMER_StopVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id);
  APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
  bleAppContext.Device_Connection_Status = APP_BLE_IDLE; 
    
  /* Start the Discovery mode to accept a connection.
  The BLE_SerialPort_CentralPeripheral application can be either a central or a peripheral.
  To connect to each other, two devices with the same firmware are loaded onto STM32WB0 devices. The application starts in discovery mode,
  scanning for peripherals. Since the same application can also be a peripheral, at the end of the GAP discovery procedure, the application
  decides to enable advertising so that it can be found by a central that is scanning. */
  UTIL_SEQ_SetTask(1U << TASK_BUTTON_3, CFG_SEQ_PRIO_0); 
  
  return;
}


/**
* @brief Fill the advertising data with specific information.
*
* This function fills the advertising data with specific information such as the
* manufacturer-specific data and the complete local name. It also converts parts
* of the Bluetooth device address into ASCII characters and inserts them into the
* advertising data.
*
* @param p_adv_data Pointer to the advertising data array.
* @param tab_size Size of the advertising data array.
* @param p_bd_addr Pointer to the Bluetooth device address.
*/
static void Fill_AdvData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t* p_bd_addr)
{
  uint16_t i =0;
  uint8_t bd_addr_1, bd_addr_0;
  uint8_t ad_length, ad_type;  
  
  while(i < tab_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
      
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_COMPLETE_LOCAL_NAME:
      {
        if((p_adv_data[i + ad_length] == 'X') && (p_adv_data[i + ad_length - 1] == 'X'))
        {
          bd_addr_1 = ((p_bd_addr[0] & 0xF0)>>4);
          bd_addr_0 = (p_bd_addr[0] & 0xF);
          
          /* Convert hex value into ascii */
          if(bd_addr_1 > 0x09)
          {
            p_adv_data[i + ad_length - 1] = bd_addr_1 + '7';
          }
          else
          {
            p_adv_data[i + ad_length - 1] = bd_addr_1 + '0';
          }
          
