STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_SerialPort_CentralPeripheral/STM32_BLE/App/app_ble.c
          if(bd_addr_0 > 0x09)
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '7';
          }
          else
          {
            p_adv_data[i + ad_length] = bd_addr_0 + '0';
          }
        }
        break;
      }
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        p_adv_data[i+2] = ST_MANUF_ID_LSB;
        p_adv_data[i+3] = ST_MANUF_ID_MSB;
        p_adv_data[i+4] = BLUESTSDK_V2; /* blueST SDK version */
        p_adv_data[i+5] = BOARD_ID_NUCLEO_WB0; /* Board ID */
        p_adv_data[i+6] = FW_ID_SP_PERIPHERAL; /* FW ID */
        p_adv_data[i+7] = FW_ID_SP_PERIPHERAL_D1; /* FW data 1 */
        p_adv_data[i+8] = FW_ID_SP_PERIPHERAL_D2; /* FW data 2 */
        p_adv_data[i+9] = FW_ID_SP_PERIPHERAL_D3; /* FW data 3 */
        p_adv_data[i+10] = p_bd_addr[5]; /* MSB BD address */
        p_adv_data[i+11] = p_bd_addr[4];
        p_adv_data[i+12] = p_bd_addr[3];
        p_adv_data[i+13] = p_bd_addr[2];
        p_adv_data[i+14] = p_bd_addr[1];
        p_adv_data[i+15] = p_bd_addr[0]; /* LSB BD address */
        break;
      }
    default:
      break;
    }
    i += ad_length + 1; /* increment the iterator to go on next element*/
  }
}

/**
* @brief Analyse the advertising report to find a specific peripheral.
*
* This function parses the advertising data to identify a specific peripheral
* based on manufacturer-specific data. If the peripheral is found, its address
* and address type are stored in the application context.
*
* @param adv_data_size Size of the advertising data.
* @param p_adv_data Pointer to the advertising data.
* @param address_type Type of the address (public or random).
* @param p_address Pointer to the address of the advertising device.
* @return uint8_t Returns 1 if the specific peripheral is found, otherwise 0.
*/
static uint8_t Analyse_Adv_Report(uint8_t adv_data_size, uint8_t *p_adv_data,
                                  uint8_t address_type, uint8_t *p_address)
{
  uint8_t found_status = 0;
  uint16_t i = 0;
  uint8_t ad_length, ad_type;
  
  while(i < adv_data_size)
  {
    ad_length = p_adv_data[i];
    ad_type = p_adv_data[i + 1];
    
    switch (ad_type)
    {
    case AD_TYPE_FLAGS:
      break;
    case AD_TYPE_TX_POWER_LEVEL:
      break;
    case AD_TYPE_MANUFACTURER_SPECIFIC_DATA:
      {
        if ((ad_length >= 7)                                        && 
            (p_adv_data[i + 2] == ST_MANUF_ID_LSB)                  &&
              (p_adv_data[i + 3] == ST_MANUF_ID_MSB)                &&
                (p_adv_data[i + 4] == BLUESTSDK_V2)                 &&
                  (p_adv_data[i + 6] == FW_ID_SP_PERIPHERAL)        &&
                    (p_adv_data[i + 7] == FW_ID_SP_PERIPHERAL_D1)   &&
                      (p_adv_data[i + 8] == FW_ID_SP_PERIPHERAL_D2) &&
                        (p_adv_data[i + 9] == FW_ID_SP_PERIPHERAL_D3))
        {
          /* Peripheral BlueST v2 detected */
          bleAppContext.deviceServerBdAddrType = address_type;
          memcpy(bleAppContext.a_deviceServerBdAddr, p_address, BD_ADDR_SIZE);
          
          bleAppContext.deviceServerFound = 0x01;
          
          APP_DBG_MSG("  Peripheral, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                      bleAppContext.a_deviceServerBdAddr[5],
                      bleAppContext.a_deviceServerBdAddr[4],
                      bleAppContext.a_deviceServerBdAddr[3],
                      bleAppContext.a_deviceServerBdAddr[2],
                      bleAppContext.a_deviceServerBdAddr[1],
                      bleAppContext.a_deviceServerBdAddr[0]);
          found_status = 1;
        }
        break;
      }
    default:
      break;
    }/* end of switch*/
    
    i += ad_length + 1; /* increment the iterator to go on next element*/
    
    if (found_status != 0)
    {
      break;
    }
  }/* end of while*/
  
  return found_status;
}

/**
 * @brief Initiates a security request for the peripheral device.
 * 
 * This function checks the connection handles in the BLE application context and 
 * initiates a security request using the appropriate connection handle. If a valid 
 * connection handle is found, it sets the security level to GAP_SECURITY_LEVEL_2.
 * 
 * @note This function assumes that the BLE application context has been properly 
 *       initialized and that the connection handles are valid.
 * 
 * @retval None
 */
static void Periph_Security_Request(void)
{
  tBleStatus status;
  status = aci_gap_set_security(bleAppContext.BleApplicationContext_legacy.connectionHandle, GAP_SECURITY_LEVEL_2, 0);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Periph security request cmd failure: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("Periph security request cmd success\n");
  }
  BLEStack_Process_Schedule();
}

static uint32_t Get_Random_Delay(void)
{
  uint16_t random_number;
  if (HW_RNG_GetRandom16(&random_number) == HW_RNG_SUCCESS)
  {
    /* Generate a random delay between 3000 and 4000 milliseconds with increments of 50 */
    uint32_t x = ((random_number % 21) * 50) + 3000;
    APP_DBG_MSG("  Get_Random_Delay %04d\n", x);
    return x;
  }
  else
  {
    /* Handle error */
    APP_DBG_MSG("  RNG Error, fixed 3000 is returned\n");
    return 3000; // Default value in case of error
  }
}
/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
/**
 * @brief This function handles the action for Button 1 press.
 *        If the device peripheral state is in an idle state, it will relaunch advertising.
 * 
 * @retval None
 */
void APPE_Button1Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    /* Relaunch advertising */
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
  }
  else
  {
    APP_DBG_MSG("Device_Connection_Status 0x%02X\n", bleAppContext.Device_Connection_Status);
  }	
  return;
}


/**
 * @brief  Handles the action when Button 2 is pressed.
 * 
 * This function checks the connection status of the BLE device. If the device is not connected
 * as either a central client or a peripheral server, it attempts to clear the security database.
 * If the device is connected, it sets a task for peripheral security request.
 * 
 * @retval None
 */
void APPE_Button2Action(void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT && bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  else if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    APP_DBG_MSG("  SetTask CFG_TASK_PERIPH_SECURITY_REQUEST_ID\n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_PERIPH_SECURITY_REQUEST_ID, CFG_SEQ_PRIO_0);
  }

  return;
}


/**
 * @brief  Action to be performed when Button 3 is pressed.
 * 
 * This function initiates the BLE scan procedure if the central device's 
 * connection status is idle. If the central device is idle, it sets the 
 * connection status to scanning and starts the scanning process. Additionally, 
 * it sets the BLE stack process priority to low to handle limited cases where 
 * the stack needs to be rescheduled for busy waiting.
 * 
 * If the central device is not idle, it logs the peripheral device's connection status.
 * 
 * @retval None
 */
void APPE_Button3Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    /* Relaunch advertising */
    APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
  }
  else
  {
    APP_DBG_MSG("Device_Connection_Status 0x%02X\n", bleAppContext.Device_Connection_Status);
  }	
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
